package com.epam.rd.java.basic.practice4;

/*
Задача 2
—-----
Имя класса: com.epam.rd.java.basic.practice4.Part2
Входные данные должны быть загружены из файла 'part2.txt'
Выходные данные должны быть загружены в файл part2_sorted.txt.
—-----

Создайте класс, который создает и заполняет файл part2.txt
случайными целыми числами от 0 до 50 (всего 10 чисел),
затем читает файл и записывает его содержимое в другой файл (part2_sorted.txt),
отсортировав числа в порядке возрастания.
Отобразите содержимое обоих файлов в консоли (числа должны быть разделены пробелом).

Напишите свой собственный метод сортировки, который использует для этого какой-нибудь алгоритм
(например, пузырьковая сортировка). Выходной файл должен быть читабельным.
Отобразите содержимое файлов ввода и вывода в консоли.

Пример вывода на консоль
—-----
ввод ==> 30 23 16 16 9 23 3 18 21 29
выход ==> 3 9 16 16 18 21 23 23 29 30
—-----
 */

public class Part2 {

    public static void main(String[] args) {

    }

}
