package com.epam.rd.java.basic.practice4;

/*
Задание 1
—-----
Имя класса: com.epam.rd.java.basic.practice4.Part1
Входные данные должны быть загружены из файла 'part1.txt'
—-----

Создайте класс, который отображает содержимое текстового файла на консоли,
удаляя первые два символа каждого слова длиной 4 и более символов
(пример: исходный «qwerty», новый «erty»).

Размер файла не должен превышать 1Кб (достаточно нескольких строк).

«Слово» следует рассматривать как непрерывную последовательность кириллических или латинских символов.
 */



public class Part1 {

    public static void main(String[] args) {

    }
}
