package com.epam.rd.java.basic.practice4;

/*
Задача 6
—-----
Имя класса: com.epam.rd.java.basic.practice4.Part6
Входной файл - part6.txt.
—-----

Файл содержит слова, написанные кириллицей и латинскими буквами.
Создайте класс, который считывает ввод пользователя с консоли
и в ответ выводит все конкретные слова из файла.
Если пользователь вводит «cyrl», то печатаются все слова с русскими или украинскими символами.
Если пользователь вводит «латн», то печатаются все слова с латинским набором символов.
Ввод с любым регистром (верхним или нижним) должен распознаваться.
Если пользователь вводит слово «стоп», приложение закрывается.
В остальных случаях программа выводит «Неправильный ввод».

Пример входного файла:
—-----
Кто-нибудь послушает мою историю?
Лягає день. Він віддає свої надії ночі.
Робітники
Заморились працювати.
С барабаном ходит ёжик. Бум-бум-бум.
—-----

Пример вывода консоли:
—-----
asdf <Enter>
asdf: неправильный ввод
Latn <Enter>
Latn: Кто-нибудь послушает мою историю?
Кирл <Enter>
Cyrl: Лягає день Він віддає свої надії ночі Робітники Заморились працювати
С барабаном ходит ёжик Бум бум бум
останавливаться
 */

public class Part6 {

    public static void main(String[] args) {

    }

}
