package com.epam.rd.java.basic.practice4;

/*
Задача 4
—-----
Имя класса: com.epam.rd.java.basic.practice4.Part4
Входные данные должны быть загружены из файла 'part4.txt'
—-----

Создайте класс, реализующий интерфейс java.lang.Iterable <String>.
Класс должен проанализировать текстовый файл и вернуть предложения.
Метод итератора данного класса должен возвращать объект итератора - экземпляр внутреннего класса.
Метод Iterator # remove должен вызывать исключение UnsupportedOperationException.

Вам не разрешается использовать существующие реализации итераторов из контейнерных классов!

Примечание. Напишите регулярное выражение, которое «вырезает» предложения из текста,
а затем используйте объект Matcher при реализации методов интерфейса Iterator.
 */

public class Part4 {

    public static void main(String[] args) {

    }

}
