package com.epam.rd.java.basic.practice4;

/*
Задача 3
—-----
Имя класса: com.epam.rd.java.basic.practice4.Part3
Входные данные должны быть загружены из файла part3.txt.
—-----

Файл содержит символы, целые числа и числа с плавающей запятой.
Напишите класс, который имеет следующий функционал:
в цикле пользователь вводит тип данных (один из них: char, int, double, String),
в ответ приложение выводит на консоль все значения соответствующих типов которые существуют в файле.
Если пользователь вводит слово «стоп», приложение выходит из цикла.
В остальных случаях следует распечатать «Неправильный ввод».
Решите задачу с помощью регулярных выражений.

Примечание. «Строку» следует рассматривать как последовательность из двух и более символов.
Символы - буквы латиницы или кириллицы в верхнем или нижнем регистре
(обязательно предусмотрите, что во входном файле могут быть буквы кириллицы).

Пример исходного файла:
—-----
а bcd 43.43 432 и л фвыа 89.98
—-----
 */

public class Part3 {

    public static void main(String[] args) {

    }

}
